toniebox-reverse-engineering/teddycloud/cyclone/cyclone_crypto/hardware/msp432e4/msp432e4_crypto_cipher.c
/**
 * @file msp432e4_crypto_cipher.c
 * @brief MSP432E4 cipher hardware accelerator
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2022 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneCRYPTO Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.2.0
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL CRYPTO_TRACE_LEVEL

//Dependencies
#include <stdint.h>
#include "msp432.h"
#include "driverlib/des.h"
#include "driverlib/aes.h"
#include "core/crypto.h"
#include "hardware/msp432e4/msp432e4_crypto.h"
#include "hardware/msp432e4/msp432e4_crypto_cipher.h"
#include "cipher/cipher_algorithms.h"
#include "cipher_modes/cipher_modes.h"
#include "aead/aead_algorithms.h"
#include "debug.h"

//Check crypto library configuration
#if (MSP432E4_CRYPTO_CIPHER_SUPPORT == ENABLED)


/**
 * @brief Set DES operation mode
 * @param[in] mode Mode of operation
 **/

void desSetMode(uint32_t mode)
{
   //Perform a software reset
   DES->SYSCONFIG |= DES_SYSCONFIG_SOFTRESET;

   //Wait for the reset to complete
   while((DES->SYSSTATUS & DES_SYSSTATUS_RESETDONE) == 0)
   {
   }

   //Backup the save context field before updating the register
   if((DES->CTRL & DES_CTRL_CONTEXT) != 0)
   {
      mode |= DES_CTRL_CONTEXT;
   }

   //Write control register
   DES->CTRL = mode;
}


#if (DES_SUPPORT == ENABLED)

/**
 * @brief Perform DES encryption or decryption
 * @param[in] context DES algorithm context
 * @param[in,out] iv Initialization vector
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[in] mode Operation mode
 **/

void desProcessData(DesContext *context, uint8_t *iv, const uint8_t *input,
   uint8_t *output, size_t length, uint32_t mode)
{
   uint32_t temp;

   //Acquire exclusive access to the DES module
   osAcquireMutex(&msp432e4CryptoMutex);

   //Set operation mode
   desSetMode(DES_CFG_SINGLE | mode);

   //Set encryption key
   DES->KEY1_L = context->ks[0];
   DES->KEY1_H = context->ks[1];

   //Valid initialization vector?
   if(iv != NULL)
   {
      //Set initialization vector
      DES->IV_L = LOAD32LE(iv);
      DES->IV_H = LOAD32LE(iv + 4);
   }

   //Set data length
   DES->LENGTH = length;

   //Process data
   while(length >= DES_BLOCK_SIZE)
   {
      //Wait for the DES engine to be ready to accept data
      while((DES->CTRL & DES_CTRL_INPUT_READY) == 0)
      {
      }

      //Write input block
      DES->DATA_L = LOAD32LE(input);
      DES->DATA_H = LOAD32LE(input + 4);

      //Wait for the output to be ready
      while((DES->CTRL & DES_CTRL_OUTPUT_READY) == 0)
      {
      }

      //Read output block
      temp = DES->DATA_L;
      STORE32LE(temp, output);
      temp = DES->DATA_H;
      STORE32LE(temp, output + 4);

      //Next block
      input += DES_BLOCK_SIZE;
      output += DES_BLOCK_SIZE;
      length -= DES_BLOCK_SIZE;
   }

   //Process final block of data
   if(length > 0)
   {
      uint32_t buffer[2];

      //Copy partial block
      osMemset(buffer, 0, DES_BLOCK_SIZE);
      osMemcpy(buffer, input, length);

      //Wait for the DES engine to be ready to accept data
      while((DES->CTRL & DES_CTRL_INPUT_READY) == 0)
      {
      }

      //Write input block
      DES->DATA_L = buffer[0];
      DES->DATA_H = buffer[1];

      //Wait for the output to be ready
      while((DES->CTRL & DES_CTRL_OUTPUT_READY) == 0)
      {
      }

      //Read output block
      buffer[0] = DES->DATA_L;
      buffer[1] = DES->DATA_H;

      //Copy partial block
      osMemcpy(output, buffer, length);
   }

   //Valid initialization vector?
   if(iv != NULL)
   {
      //Update the value of the initialization vector
      temp = DES->IV_L;
      STORE32LE(temp, iv);
      temp = DES->IV_H;
      STORE32LE(temp, iv + 4);
   }

   //Release exclusive access to the DES module
   osReleaseMutex(&msp432e4CryptoMutex);
}


/**
 * @brief Initialize a DES context using the supplied key
 * @param[in] context Pointer to the DES context to initialize
 * @param[in] key Pointer to the key
 * @param[in] keyLen Length of the key (must be set to 8)
 * @return Error code
 **/

error_t desInit(DesContext *context, const uint8_t *key, size_t keyLen)
{
   //Check parameters
   if(context == NULL || key == NULL)
      return ERROR_INVALID_PARAMETER;

   //Invalid key length?
   if(keyLen != 8)
      return ERROR_INVALID_KEY_LENGTH;

   //Copy the key
   osMemcpy(context->ks, key, keyLen);

   //No error to report
   return NO_ERROR;
}


/**
 * @brief Encrypt a 8-byte block using DES algorithm
 * @param[in] context Pointer to the DES context
 * @param[in] input Plaintext block to encrypt
 * @param[out] output Ciphertext block resulting from encryption
 **/

void desEncryptBlock(DesContext *context, const uint8_t *input, uint8_t *output)
{
   //Perform DES encryption
   desProcessData(context, NULL, input, output, DES_BLOCK_SIZE,
      DES_CFG_DIR_ENCRYPT | DES_CFG_MODE_ECB);
}


/**
 * @brief Decrypt a 8-byte block using DES algorithm
 * @param[in] context Pointer to the DES context
 * @param[in] input Ciphertext block to decrypt
 * @param[out] output Plaintext block resulting from decryption
 **/

void desDecryptBlock(DesContext *context, const uint8_t *input, uint8_t *output)
{
   //Perform DES decryption
   desProcessData(context, NULL, input, output, DES_BLOCK_SIZE,
      DES_CFG_DIR_DECRYPT | DES_CFG_MODE_ECB);
}

#endif
#if (DES3_SUPPORT == ENABLED)

/**
 * @brief Perform Triple DES encryption or decryption
 * @param[in] context Triple DES algorithm context
 * @param[in,out] iv Initialization vector
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[in] mode Operation mode
 **/

void des3ProcessData(Des3Context *context, uint8_t *iv, const uint8_t *input,
   uint8_t *output, size_t length, uint32_t mode)
{
   uint32_t temp;

   //Acquire exclusive access to the DES module
   osAcquireMutex(&msp432e4CryptoMutex);

   //Set operation mode
   desSetMode(DES_CFG_TRIPLE | mode);

