toniebox-reverse-engineering/teddycloud/cyclone/cyclone_crypto/hardware/msp432e4/msp432e4_crypto_cipher.c
         //Process plaintext
         while(length > 0)
         {
            //CTR mode operates in a block-by-block fashion
            n = MIN(length, cipher->blockSize);

            //Compute O(j) = CIPH(T(j))
            cipher->encryptBlock(context, t, o);

            //Compute C(j) = P(j) XOR T(j)
            for(i = 0; i < n; i++)
            {
               c[i] = p[i] ^ o[i];
            }

            //Standard incrementing function
            for(temp = 1, i = 1; i <= m; i++)
            {
               //Increment the current byte and propagate the carry
               temp += t[cipher->blockSize - i];
               t[cipher->blockSize - i] = temp & 0xFF;
               temp >>= 8;
            }

            //Next block
            p += n;
            c += n;
            length -= n;
         }
      }
      else
      {
         //The value of the parameter is not valid
         error = ERROR_INVALID_PARAMETER;
      }
   }

   //Return status code
   return error;
}

#endif
#if (GCM_SUPPORT == ENABLED && AES_SUPPORT == ENABLED)

/**
 * @brief Perform AES-GCM encryption or decryption
 * @param[in] context AES algorithm context
 * @param[in] iv Initialization vector
 * @param[in] a Additional authenticated data
 * @param[in] aLen Length of the additional data
 * @param[in] input Data to be encrypted/decrypted
 * @param[out] output Data resulting from the encryption/decryption process
 * @param[in] length Total number of data bytes to be processed
 * @param[out] t Authentication tag
 * @param[in] mode Operation mode
 **/

void gcmProcessData(AesContext *context, const uint8_t *iv,
   const uint8_t *a, size_t aLen, const uint8_t *input, uint8_t *output,
   size_t length, uint8_t *t, uint32_t mode)
{
   uint32_t temp;
   uint32_t buffer[4];

   //Acquire exclusive access to the AES module
   osAcquireMutex(&msp432e4CryptoMutex);

   //Check parameters
   if(aLen > 0 || length > 0)
   {
      //Set GCM operation mode
      aesSetMode(AES_CFG_MODE_GCM_HY0CALC | mode);
      //Set encryption key
      aesLoadKey(context);

      //When the length of the IV is 96 bits, the padding string is appended to
      //the IV to form the pre-counter block
      AES->IV_IN_0 = LOAD32LE(iv);
      AES->IV_IN_1 = LOAD32LE(iv + 4);
      AES->IV_IN_2 = LOAD32LE(iv + 8);
      AES->IV_IN_3 = BETOH32(1);

      //Set data length
      AES->C_LENGTH_0 = length;
      AES->C_LENGTH_1 = 0;

      //Set additional authenticated data length
      AES->AUTH_LENGTH = aLen;

      //Process additional authenticated data
      while(aLen >= AES_BLOCK_SIZE)
      {
         //Wait for the AES engine to be ready to accept data
         while((AES->CTRL & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write block
         AES->DATA_IN_3 = LOAD32LE(a);
         AES->DATA_IN_2 = LOAD32LE(a + 4);
         AES->DATA_IN_1 = LOAD32LE(a + 8);
         AES->DATA_IN_0 = LOAD32LE(a + 12);

         //Next block
         a += AES_BLOCK_SIZE;
         aLen -= AES_BLOCK_SIZE;
      }

      //Process final block of additional authenticated data
      if(aLen > 0)
      {
         //Copy partial block
         osMemset(buffer, 0, AES_BLOCK_SIZE);
         osMemcpy(buffer, a, aLen);

         //Wait for the AES engine to be ready to accept data
         while((AES->CTRL & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write block
         AES->DATA_IN_3 = buffer[0];
         AES->DATA_IN_2 = buffer[1];
         AES->DATA_IN_1 = buffer[2];
         AES->DATA_IN_0 = buffer[3];
      }

      //Process data
      while(length >= AES_BLOCK_SIZE)
      {
         //Wait for the AES engine to be ready to accept data
         while((AES->CTRL & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write input block
         AES->DATA_IN_3 = LOAD32LE(input);
         AES->DATA_IN_2 = LOAD32LE(input + 4);
         AES->DATA_IN_1 = LOAD32LE(input + 8);
         AES->DATA_IN_0 = LOAD32LE(input + 12);

         //Wait for the output to be ready
         while((AES->CTRL & AES_CTRL_OUTPUT_READY) == 0)
         {
         }

         //Read output block
         temp = AES->DATA_IN_3;
         STORE32LE(temp, output);
         temp = AES->DATA_IN_2;
         STORE32LE(temp, output + 4);
         temp = AES->DATA_IN_1;
         STORE32LE(temp, output + 8);
         temp = AES->DATA_IN_0;
         STORE32LE(temp, output + 12);

         //Next block
         input += AES_BLOCK_SIZE;
         output += AES_BLOCK_SIZE;
         length -= AES_BLOCK_SIZE;
      }

      //Process final block of data
      if(length > 0)
      {
         //Copy partial block
         osMemset(buffer, 0, AES_BLOCK_SIZE);
         osMemcpy(buffer, input, length);

         //Wait for the AES engine to be ready to accept data
         while((AES->CTRL & AES_CTRL_INPUT_READY) == 0)
         {
         }

         //Write input block
         AES->DATA_IN_3 = buffer[0];
         AES->DATA_IN_2 = buffer[1];
         AES->DATA_IN_1 = buffer[2];
         AES->DATA_IN_0 = buffer[3];

         //Wait for the output to be ready
         while((AES->CTRL & AES_CTRL_OUTPUT_READY) == 0)
         {
         }

         //Read output block
         buffer[0] = AES->DATA_IN_3;
         buffer[1] = AES->DATA_IN_2;
         buffer[2] = AES->DATA_IN_1;
         buffer[3] = AES->DATA_IN_0;

         //Copy partial block
         osMemcpy(output, buffer, length);
      }

      //Wait for the output context to be ready
      while((AES->CTRL & AES_CTRL_SVCTXTRDY) == 0)
      {
      }

      //Read the authentication tag
      temp = AES->TAG_OUT_0;
      STORE32LE(temp, t);
      temp = AES->TAG_OUT_1;
      STORE32LE(temp, t + 4);
      temp = AES->TAG_OUT_2;
      STORE32LE(temp, t + 8);
      temp = AES->TAG_OUT_3;
      STORE32LE(temp, t + 12);
   }
   else
   {
      //Set CTR operation mode
      aesSetMode(AES_CFG_DIR_ENCRYPT | AES_CFG_MODE_CTR |
         AES_CFG_CTR_WIDTH_32);

